---
kind: enumMember
id: F:Autodesk.Revit.DB.CompoundStructureError.CoreTooThin
enum: Autodesk.Revit.DB.CompoundStructureError
source: html/8e8457e0-84c4-ccb1-114c-fa25a6d37fed.htm
---
# Autodesk.Revit.DB.CompoundStructureError.CoreTooThin

Core contain a membrane layer or thickness of core is zero.